In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [3]:
%%sql

SELECT *

FROM facts
LIMIT 2;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3)]

In [5]:
%%sql
SELECT *
    FROM sqlite_master
WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [6]:
%%sql 
SELECT *
FROM facts
LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [7]:
"""Write a single query that returns the:

Minimum population
Maximum population
Minimum population growth
Maximum population growth"""


%%sql

SELECT MIN(population), MAX(population),
MIN(population_growth), MAX(population_growth)

FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [15]:
"""Write a query
that returns the countrie(s) with the minimum population"""

%%sql

SELECT name
FROM facts
WHERE population = ( SELECT MIN(population) FROM facts)

Done.

[('Antarctica',)]

In [16]:
"""Write a query that returns the
countrie(s) with the maximum population."""


%%sql

SELECT name
FROM facts
WHERE population = ( SELECT MAX(population) FROM facts)

Done.

[('World',)]

In [17]:

"""Recompute the summary statistics you found earlier while excluding the row for the whole world. They were:

Minimum population
Maximum population
Minimum population growth
Maximum population growth"""
%%sql

SELECT MIN(population), MAX(population),
MIN(population_growth), MAX(population_growth)

FROM facts
WHERE name NOT IN ('World', 'Antarctica') 
;

Done.

[(48, 1367485388, 0.0, 4.02)]

In [18]:
"""In a different code cell, 
calculate the average value for the following columns:
population
area"""

%%sql

SELECT AVG(population), AVG(area)
FROM facts;

Done.

[(62094928.32231405, 555093.546184739)]

In [ ]:
"""Write a query that finds all 
countries meeting both of the following conditions:
The population is above average.
The area is below average."""

In [23]:
%%sql


 

SELECT name
FROM facts
WHERE population > (SELECT AVG(population) FROM facts) AND
area< (SELECT AVG(area) FROM facts)

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

In [ ]:
"""What country has the most people? 
What country has the highest growth rate?"""

In [26]:

%%sql

SELECT name
FROM facts
WHERE name NOT IN ('World') AND population=(SELECT MAX(population)
                                           FROM facts
                                           )

Done.

[('World',)]

In [27]:
%%sql

SELECT name
FROM facts
WHERE  population=(SELECT MAX(population)
        FROM facts  )
EXCEPT
SELECT name
FROM facts
WHERE name NOT IN ('World')

Done.

[('World',)]

In [ ]:
SELECT JobTitle
FROM   HumanResources.Employee
WHERE  Gender = 'M'
EXCEPT
SELECT JobTitle
FROM   HumanResources.Employee
WHERE  Gender = 'F'

In [ ]:
'''What country has the most people? What country has the highest growth rate?
Which countries have the highest ratios of water to land? Which countries have more water than land?
Which countries will add the most people to their population next year?
Which countries have a higher death rate than birth rate?
What countries have the highest population/area ratio and how does it compare to list we found in the previous screen?'''